sample_app/app/helpers/sessions_helper.rb

	def current_user
		# if session[:user_id]
		# 	@current_user ||= User.find_by(id: session[:user_id])
		# end
		if (user_id = session[:user_id])
			@current_user ||= User.find_by(id: user_id)
		elsif (user_id = cookies.encrypted[:user_id])
			# raise  # The test still pass, so this branch is currently untested.
			user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]